from unittest import TestCase
from main import search_popular_name, unique_names, duration_courses
from ya_app import create_folder


class TestPopularName(TestCase):
    """Тест топ 3 популярных имен"""

    def test_accurate_result(self):
        name = [
            ["Игорь Шмаргунов", "Олег Булыгин", "Игорь Демидов", "Кирилл Табельский", "Игорь Ульянцев",
             "Роман Гордиенко"],
            ["Игорь Воронов", "Павел Дерендяев"],
            ["Игорь Нуруллин", "Олег Шек", "Максим Филипенко", "Елена Никитина"],
            ["Олег Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
             "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
        ]
        res = search_popular_name(name)
        expected = f'Игорь: 5 раз(а), Олег: 3 раз(а), Александр: 2 раз(а)'
        self.assertEqual(res,expected)

    def test_element_insertion(self):
        name = [
            ["Игорь Шмаргунов", "Олег Булыгин", "Игорь Демидов", "Кирилл Табельский", "Игорь Ульянцев",
             "Роман Гордиенко"],
            ["Игорь Воронов", "Павел Дерендяев"],
            ["Игорь Нуруллин", "Олег Шек", "Максим Филипенко", "Елена Никитина"],
            ["Олег Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
             "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
        ]
        res = search_popular_name(name)
        expected = 'Игорь'
        self.assertIn(expected, res)


class TestSearchUniqueNames(TestCase):
    """Тест уникальных имен"""

    def test_empty_value1(self):
        name = [
            ["Игорь Шмаргунов", "Олег Булыгин", "Игорь Демидов", "Кирилл Табельский", "Игорь Ульянцев",
             "Роман Гордиенко"],
            ["Игорь Воронов", "Павел Дерендяев"],
            ["Игорь Нуруллин", "Олег Шек", "Максим Филипенко", "Елена Никитина"],
            ["Олег Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
             "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
        ]
        res = unique_names(name)
        self.assertIsNotNone(res)

    def test_empty_value2(self):
        name = [
            ["Игорь Шмаргунов", "Олег Булыгин", "Игорь Демидов", "Кирилл Табельский", "Игорь Ульянцев",
             "Роман Гордиенко"],
            ["Игорь Воронов", "Павел Дерендяев"],
            ["Игорь Нуруллин", "Олег Шек", "Максим Филипенко", "Елена Никитина"],
            ["Олег Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
             "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
        ]
        res = unique_names(name)
        expected = 'Шмаргунов'
        self.assertNotIn(expected, res)


class TestDurationCourses(TestCase):
    """Тест продолжительности курса"""

    def test_insertion_of_name(self):
        name = [
            ["Игорь Шмаргунов", "Олег Булыгин", "Игорь Демидов", "Кирилл Табельский", "Игорь Ульянцев",
             "Роман Гордиенко"],
            ["Игорь Воронов", "Павел Дерендяев"],
            ["Игорь Нуруллин", "Олег Шек", "Максим Филипенко", "Елена Никитина"],
            ["Олег Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
             "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
        ]
        a = 'Fullstack-разработчик на Python'
        res = duration_courses(name)
        self.assertIn(a, res)


class TestCreateFolder(TestCase):
    """Тест создания папки на яндекс диске"""

    def test_status_code1(self):
        a = 201
        res = create_folder('MyFolder', 'Token')
        self.assertEqual(a, res)

    def test_status_code2(self):
        a = 409
        res = create_folder('MyFolder', 'Token')
        self.assertEqual(a, res)

    def test_status_code3(self):
        a = 401
        res = create_folder('MyFolder', 'Token')
        self.assertEqual(a, res)